#ifndef __WEULARQ_H
#define __WEULARQ_H

#include "stm32f10x.h"
#include "wCommonAlg.h"
#include "wEstimation.h"

 /**************************************************************************
#     fR, fP, fY分别对应绕x，y，z旋转，输入为弧度
#    以下所有的变换都是基于地面坐标系沿z-y-x顺序变换到机体坐标系
# **************************************************************************/

 /**************************************************************************
#     欧拉角求地面到机体方向余弦矩阵EBDCM。
# **************************************************************************/
void vEularToEBDCM(float fDCM[3][3], float fR, float fP, float fY);

 /**************************************************************************
#     欧拉角求地面到机体方向余弦矩阵BEDCM。
# **************************************************************************/
void vEularToBEDCM(float fDCM[3][3], float fR, float fP, float fY);

/**************************************************************************
    四元数求地面到机体方向余弦矩阵BEDCM
**************************************************************************/
void vQuatToBEDCM(float fDCM[3][3], float *fQ);
# /**************************************************************************
#     输入为四元数fQ,得到从地面到机体的变换矩阵EBDCM
# **************************************************************************/

void vQuatToEBDCM(float fDCM[3][3], float *fQ);

/**************************************************************************
    欧拉角求四元数
**************************************************************************/

void vEularToQuat(float fR, float fP, float fY, float *fQ);

/**************************************************************************
    四元数求欧拉角Roll,Pitch,Yaw.单位度
**************************************************************************/
void vQuatToEular(float *fE, float *fQ);

/**************************************************************************
	从地面到机体坐标的变换输入为fQ,fB，fE，先由四元数fQ从地面到机体的变换矩阵fEBDCM，再求fB
**************************************************************************/
void vEToB_EXCH(float *fQ, float *fB, float *fE);
/**************************************************************************
	从机体到地面坐标的变换输入为四元数fQ，fB，fE，先由四元数fQ得到从机体到地面的变换矩阵fBEDCM，再求fE
**************************************************************************/
void vBToE_EXCH(float *fQ, float *fB, float *fE);

/**************************************************************************
	四元数求地面到机体方向余弦矩阵EBDCM
**************************************************************************/
void vQuatToEBDCM(float fDCM[3][3], float *fQ);

/**************************************************************************
	四元数初始化：利用加速度计三轴加速度fA及磁力计测量fM实现
**************************************************************************/
void vQuat_Init(float *fA, float *fM, float *fQ);

/**************************************************************************
	Mahony互补滤波，输入滤波后角速度fGF，加速度fAF及测力计fMF，互补滤波器参数qCF，角速度校正误差的积分fG_E，输出四元数
**************************************************************************/
void vMahony_Comp_F(float *fGF, float *fAF, float *fMF, QUAV_CF_P *qCF,float *fQ);

/**************************************************************************
	单阶四元数迭代计算，输入fG计算的校正信号（迭代模型的系数），fDt步长，fQ为四元数
**************************************************************************/
void vQuat_Update(float *fG, float fDt, float *fQ);


#endif
